/* automatically generated by rust-bindgen */

#![allow(non_upper_case_globals)]
#![allow(non_camel_case_types)]
#![allow(non_snake_case)]
#![allow(dead_code)]

#[link(name = "cec")] extern {}

pub const CEC_LIB_VERSION_MAJOR: u32 = 4;
pub const CEC_LIB_VERSION_MAJOR_STR: &'static [u8; 2usize] = b"4\0";
pub const CEC_LIB_VERSION_MINOR: u32 = 0;
pub const CEC_DEFAULT_PHYSICAL_ADDRESS: u32 = 4096;
pub const CEC_DEFAULT_HDMI_PORT: u32 = 1;
pub const CEC_DEFAULT_BASE_DEVICE: u32 = 0;
pub const CEC_BUTTON_TIMEOUT: u32 = 500;
pub const CEC_DOUBLE_TAP_TIMEOUT_MS: u32 = 200;
pub const CEC_POWER_STATE_REFRESH_TIME: u32 = 30000;
pub const CEC_FW_VERSION_UNKNOWN: u32 = 65535;
pub const CEC_FW_BUILD_UNKNOWN: u32 = 0;
pub const CEC_CONNECT_TRIES: u32 = 3;
pub const CEC_PHYSICAL_ADDRESS_TV: u32 = 0;
pub const CEC_MIN_PHYSICAL_ADDRESS: u32 = 4096;
pub const CEC_MAX_PHYSICAL_ADDRESS: u32 = 65534;
pub const CEC_INVALID_PHYSICAL_ADDRESS: u32 = 65535;
pub const CEC_MIN_VENDORID: u32 = 1;
pub const CEC_MAX_VENDORID: u32 = 16777214;
pub const CEC_INVALID_VENDORID: u32 = 16777215;
pub const CEC_MIN_HDMI_PORTNUMBER: u32 = 1;
pub const CEC_MAX_HDMI_PORTNUMBER: u32 = 15;
pub const CEC_HDMI_PORTNUMBER_NONE: u32 = 0;
pub const CEC_DEFAULT_SETTING_ACTIVATE_SOURCE: u32 = 1;
pub const CEC_DEFAULT_SETTING_POWER_OFF_SHUTDOWN: u32 = 1;
pub const CEC_DEFAULT_SETTING_POWER_OFF_ON_STANDBY: u32 = 1;
pub const CEC_DEFAULT_DEVICE_LANGUAGE: &'static [u8; 4usize] = b"eng\0";

pub const CEC_LOG_ALL: cec_log_level = 31;
pub type cec_log_level = u32;
pub const CEC_DEVICE_STATUS_UNKNOWN: cec_bus_device_status = 0;
pub const CEC_DEVICE_STATUS_PRESENT: cec_bus_device_status = 1;
pub const CEC_DEVICE_STATUS_NOT_PRESENT: cec_bus_device_status = 2;
pub const CEC_DEVICE_STATUS_HANDLED_BY_LIBCEC: cec_bus_device_status = 3;
pub type cec_bus_device_status = u32;
pub const CEC_VENDOR_TOSHIBA: cec_vendor_id = 57;
pub const CEC_VENDOR_SAMSUNG: cec_vendor_id = 240;
pub const CEC_VENDOR_DENON: cec_vendor_id = 1485;
pub const CEC_VENDOR_MARANTZ: cec_vendor_id = 1656;
pub const CEC_VENDOR_LOEWE: cec_vendor_id = 2434;
pub const CEC_VENDOR_ONKYO: cec_vendor_id = 2480;
pub const CEC_VENDOR_MEDION: cec_vendor_id = 3256;
pub const CEC_VENDOR_TOSHIBA2: cec_vendor_id = 3303;
pub const CEC_VENDOR_PULSE_EIGHT: cec_vendor_id = 5506;
pub const CEC_VENDOR_HARMAN_KARDON2: cec_vendor_id = 6480;
pub const CEC_VENDOR_GOOGLE: cec_vendor_id = 6673;
pub const CEC_VENDOR_AKAI: cec_vendor_id = 8391;
pub const CEC_VENDOR_AOC: cec_vendor_id = 9319;
pub const CEC_VENDOR_PANASONIC: cec_vendor_id = 32837;
pub const CEC_VENDOR_PHILIPS: cec_vendor_id = 36926;
pub const CEC_VENDOR_DAEWOO: cec_vendor_id = 36947;
pub const CEC_VENDOR_YAMAHA: cec_vendor_id = 41182;
pub const CEC_VENDOR_GRUNDIG: cec_vendor_id = 53461;
pub const CEC_VENDOR_PIONEER: cec_vendor_id = 57398;
pub const CEC_VENDOR_LG: cec_vendor_id = 57489;
pub const CEC_VENDOR_SHARP: cec_vendor_id = 524319;
pub const CEC_VENDOR_SONY: cec_vendor_id = 524358;
pub const CEC_VENDOR_BROADCOM: cec_vendor_id = 1622150;
pub const CEC_VENDOR_SHARP2: cec_vendor_id = 5458000;
pub const CEC_VENDOR_VIZIO: cec_vendor_id = 7042157;
pub const CEC_VENDOR_BENQ: cec_vendor_id = 8414697;
pub const CEC_VENDOR_HARMAN_KARDON: cec_vendor_id = 10249310;
pub const CEC_VENDOR_UNKNOWN: cec_vendor_id = 0;
pub type cec_vendor_id = u32;
pub const ADAPTERTYPE_UNKNOWN: cec_adapter_type = 0;
pub const ADAPTERTYPE_P8_EXTERNAL: cec_adapter_type = 1;
pub const ADAPTERTYPE_P8_DAUGHTERBOARD: cec_adapter_type = 2;
pub const ADAPTERTYPE_RPI: cec_adapter_type = 256;
pub const ADAPTERTYPE_TDA995x: cec_adapter_type = 512;
pub const ADAPTERTYPE_EXYNOS: cec_adapter_type = 768;
pub const ADAPTERTYPE_AOCEC: cec_adapter_type = 1280;
pub type cec_adapter_type = u32;
pub const LIBCEC_VERSION_CURRENT: libcec_version = 262148;
#[doc = " force exporting through swig"]
pub type libcec_version = u32;
pub type cec_menu_language = [::std::os::raw::c_char; 4usize];
pub type cec_osd_name = [::std::os::raw::c_char; 14usize];
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cec_log_message {
    #[doc = "< the actual message, valid until returning from the log callback"]
    pub message: *const ::std::os::raw::c_char,
    #[doc = "< log level of the message"]
    pub level: cec_log_level,
    #[doc = "< the timestamp of this message"]
    pub time: i64,
}
#[test]
fn bindgen_test_layout_cec_log_message() {
    assert_eq!(
        ::std::mem::size_of::<cec_log_message>(),
        24usize,
        concat!("Size of: ", stringify!(cec_log_message))
    );
    assert_eq!(
        ::std::mem::align_of::<cec_log_message>(),
        8usize,
        concat!("Alignment of ", stringify!(cec_log_message))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<cec_log_message>())).message as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(cec_log_message),
            "::",
            stringify!(message)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<cec_log_message>())).level as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(cec_log_message),
            "::",
            stringify!(level)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<cec_log_message>())).time as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(cec_log_message),
            "::",
            stringify!(time)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cec_keypress {
    #[doc = "< the keycode"]
    pub keycode: cec_user_control_code,
    #[doc = "< the duration of the keypress"]
    pub duration: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout_cec_keypress() {
    assert_eq!(
        ::std::mem::size_of::<cec_keypress>(),
        8usize,
        concat!("Size of: ", stringify!(cec_keypress))
    );
    assert_eq!(
        ::std::mem::align_of::<cec_keypress>(),
        4usize,
        concat!("Alignment of ", stringify!(cec_keypress))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<cec_keypress>())).keycode as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(cec_keypress),
            "::",
            stringify!(keycode)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<cec_keypress>())).duration as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(cec_keypress),
            "::",
            stringify!(duration)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct cec_adapter {
    #[doc = "< the path to the com port"]
    pub path: [::std::os::raw::c_char; 1024usize],
    #[doc = "< the name of the com port"]
    pub comm: [::std::os::raw::c_char; 1024usize],
}
#[test]
fn bindgen_test_layout_cec_adapter() {
    assert_eq!(
        ::std::mem::size_of::<cec_adapter>(),
        2048usize,
        concat!("Size of: ", stringify!(cec_adapter))
    );
    assert_eq!(
        ::std::mem::align_of::<cec_adapter>(),
        1usize,
        concat!("Alignment of ", stringify!(cec_adapter))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<cec_adapter>())).path as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(cec_adapter),
            "::",
            stringify!(path)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<cec_adapter>())).comm as *const _ as usize },
        1024usize,
        concat!(
            "Offset of field: ",
            stringify!(cec_adapter),
            "::",
            stringify!(comm)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct cec_adapter_descriptor {
    #[doc = "< the path to the com port"]
    pub strComPath: [::std::os::raw::c_char; 1024usize],
    #[doc = "< the name of the com port"]
    pub strComName: [::std::os::raw::c_char; 1024usize],
    pub iVendorId: u16,
    pub iProductId: u16,
    pub iFirmwareVersion: u16,
    pub iPhysicalAddress: u16,
    pub iFirmwareBuildDate: u32,
    pub adapterType: cec_adapter_type,
}
#[test]
fn bindgen_test_layout_cec_adapter_descriptor() {
    assert_eq!(
        ::std::mem::size_of::<cec_adapter_descriptor>(),
        2064usize,
        concat!("Size of: ", stringify!(cec_adapter_descriptor))
    );
    assert_eq!(
        ::std::mem::align_of::<cec_adapter_descriptor>(),
        4usize,
        concat!("Alignment of ", stringify!(cec_adapter_descriptor))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<cec_adapter_descriptor>())).strComPath as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(cec_adapter_descriptor),
            "::",
            stringify!(strComPath)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<cec_adapter_descriptor>())).strComName as *const _ as usize
        },
        1024usize,
        concat!(
            "Offset of field: ",
            stringify!(cec_adapter_descriptor),
            "::",
            stringify!(strComName)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<cec_adapter_descriptor>())).iVendorId as *const _ as usize
        },
        2048usize,
        concat!(
            "Offset of field: ",
            stringify!(cec_adapter_descriptor),
            "::",
            stringify!(iVendorId)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<cec_adapter_descriptor>())).iProductId as *const _ as usize
        },
        2050usize,
        concat!(
            "Offset of field: ",
            stringify!(cec_adapter_descriptor),
            "::",
            stringify!(iProductId)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<cec_adapter_descriptor>())).iFirmwareVersion as *const _ as usize
        },
        2052usize,
        concat!(
            "Offset of field: ",
            stringify!(cec_adapter_descriptor),
            "::",
            stringify!(iFirmwareVersion)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<cec_adapter_descriptor>())).iPhysicalAddress as *const _ as usize
        },
        2054usize,
        concat!(
            "Offset of field: ",
            stringify!(cec_adapter_descriptor),
            "::",
            stringify!(iPhysicalAddress)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<cec_adapter_descriptor>())).iFirmwareBuildDate as *const _
                as usize
        },
        2056usize,
        concat!(
            "Offset of field: ",
            stringify!(cec_adapter_descriptor),
            "::",
            stringify!(iFirmwareBuildDate)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<cec_adapter_descriptor>())).adapterType as *const _ as usize
        },
        2060usize,
        concat!(
            "Offset of field: ",
            stringify!(cec_adapter_descriptor),
            "::",
            stringify!(adapterType)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct cec_datapacket {
    #[doc = "< the actual data"]
    pub data: [u8; 64usize],
    #[doc = "< the size of the data"]
    pub size: u8,
}
#[test]
fn bindgen_test_layout_cec_datapacket() {
    assert_eq!(
        ::std::mem::size_of::<cec_datapacket>(),
        65usize,
        concat!("Size of: ", stringify!(cec_datapacket))
    );
    assert_eq!(
        ::std::mem::align_of::<cec_datapacket>(),
        1usize,
        concat!("Alignment of ", stringify!(cec_datapacket))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<cec_datapacket>())).data as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(cec_datapacket),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<cec_datapacket>())).size as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(cec_datapacket),
            "::",
            stringify!(size)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct cec_command {
    #[doc = "< the logical address of the initiator of this message"]
    pub initiator: cec_logical_address,
    #[doc = "< the logical address of the destination of this message"]
    pub destination: cec_logical_address,
    #[doc = "< 1 when the ACK bit is set, 0 otherwise"]
    pub ack: i8,
    #[doc = "< 1 when the EOM bit is set, 0 otherwise"]
    pub eom: i8,
    #[doc = "< the opcode of this message"]
    pub opcode: cec_opcode,
    #[doc = "< the parameters attached to this message"]
    pub parameters: cec_datapacket,
    #[doc = "< 1 when an opcode is set, 0 otherwise (POLL message)"]
    pub opcode_set: i8,
    #[doc = "< the timeout to use in ms"]
    pub transmit_timeout: i32,
}
#[test]
fn bindgen_test_layout_cec_command() {
    assert_eq!(
        ::std::mem::size_of::<cec_command>(),
        88usize,
        concat!("Size of: ", stringify!(cec_command))
    );
    assert_eq!(
        ::std::mem::align_of::<cec_command>(),
        4usize,
        concat!("Alignment of ", stringify!(cec_command))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<cec_command>())).initiator as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(cec_command),
            "::",
            stringify!(initiator)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<cec_command>())).destination as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(cec_command),
            "::",
            stringify!(destination)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<cec_command>())).ack as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(cec_command),
            "::",
            stringify!(ack)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<cec_command>())).eom as *const _ as usize },
        9usize,
        concat!(
            "Offset of field: ",
            stringify!(cec_command),
            "::",
            stringify!(eom)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<cec_command>())).opcode as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(cec_command),
            "::",
            stringify!(opcode)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<cec_command>())).parameters as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(cec_command),
            "::",
            stringify!(parameters)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<cec_command>())).opcode_set as *const _ as usize },
        81usize,
        concat!(
            "Offset of field: ",
            stringify!(cec_command),
            "::",
            stringify!(opcode_set)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<cec_command>())).transmit_timeout as *const _ as usize },
        84usize,
        concat!(
            "Offset of field: ",
            stringify!(cec_command),
            "::",
            stringify!(transmit_timeout)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cec_device_type_list {
    #[doc = "< the list of device types"]
    pub types: [cec_device_type; 5usize],
}
#[test]
fn bindgen_test_layout_cec_device_type_list() {
    assert_eq!(
        ::std::mem::size_of::<cec_device_type_list>(),
        20usize,
        concat!("Size of: ", stringify!(cec_device_type_list))
    );
    assert_eq!(
        ::std::mem::align_of::<cec_device_type_list>(),
        4usize,
        concat!("Alignment of ", stringify!(cec_device_type_list))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<cec_device_type_list>())).types as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(cec_device_type_list),
            "::",
            stringify!(types)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cec_logical_addresses {
    #[doc = "< the primary logical address to use"]
    pub primary: cec_logical_address,
    #[doc = "< the list of addresses"]
    pub addresses: [::std::os::raw::c_int; 16usize],
}
#[test]
fn bindgen_test_layout_cec_logical_addresses() {
    assert_eq!(
        ::std::mem::size_of::<cec_logical_addresses>(),
        68usize,
        concat!("Size of: ", stringify!(cec_logical_addresses))
    );
    assert_eq!(
        ::std::mem::align_of::<cec_logical_addresses>(),
        4usize,
        concat!("Alignment of ", stringify!(cec_logical_addresses))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<cec_logical_addresses>())).primary as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(cec_logical_addresses),
            "::",
            stringify!(primary)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<cec_logical_addresses>())).addresses as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(cec_logical_addresses),
            "::",
            stringify!(addresses)
        )
    );
}
pub const CEC_ALERT_SERVICE_DEVICE: libcec_alert = 0;
pub const CEC_ALERT_CONNECTION_LOST: libcec_alert = 1;
pub const CEC_ALERT_PERMISSION_ERROR: libcec_alert = 2;
pub const CEC_ALERT_PORT_BUSY: libcec_alert = 3;
pub const CEC_ALERT_PHYSICAL_ADDRESS_ERROR: libcec_alert = 4;
pub const CEC_ALERT_TV_POLL_FAILED: libcec_alert = 5;
pub type libcec_alert = u32;
pub const CEC_PARAMETER_TYPE_STRING: libcec_parameter_type = 0;
pub const CEC_PARAMETER_TYPE_UNKOWN: libcec_parameter_type = 1;
pub type libcec_parameter_type = u32;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct libcec_parameter {
    #[doc = "< the type of this parameter"]
    pub paramType: libcec_parameter_type,
    #[doc = "< the value of this parameter"]
    pub paramData: *mut ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout_libcec_parameter() {
    assert_eq!(
        ::std::mem::size_of::<libcec_parameter>(),
        16usize,
        concat!("Size of: ", stringify!(libcec_parameter))
    );
    assert_eq!(
        ::std::mem::align_of::<libcec_parameter>(),
        8usize,
        concat!("Alignment of ", stringify!(libcec_parameter))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<libcec_parameter>())).paramType as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(libcec_parameter),
            "::",
            stringify!(paramType)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<libcec_parameter>())).paramData as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(libcec_parameter),
            "::",
            stringify!(paramData)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ICECCallbacks {
    #[doc = " @brief Transfer a log message from libCEC to the client."]
    #[doc = " @param cbparam             Callback parameter provided when the callbacks were set up"]
    #[doc = " @param message             The message to transfer."]
    pub logMessage: ::std::option::Option<
        unsafe extern "C" fn(cbparam: *mut ::std::os::raw::c_void, message: *const cec_log_message),
    >,
    #[doc = " @brief Transfer a keypress from libCEC to the client."]
    #[doc = " @param cbparam             Callback parameter provided when the callbacks were set up"]
    #[doc = " @param key                 The keypress to transfer."]
    pub keyPress: ::std::option::Option<
        unsafe extern "C" fn(cbparam: *mut ::std::os::raw::c_void, key: *const cec_keypress),
    >,
    #[doc = " @brief Transfer a CEC command from libCEC to the client."]
    #[doc = " @param cbparam             Callback parameter provided when the callbacks were set up"]
    #[doc = " @param command             The command to transfer."]
    pub commandReceived: ::std::option::Option<
        unsafe extern "C" fn(cbparam: *mut ::std::os::raw::c_void, command: *const cec_command),
    >,
    #[doc = " @brief Transfer a changed configuration from libCEC to the client"]
    #[doc = " @param cbparam             Callback parameter provided when the callbacks were set up"]
    #[doc = " @param configuration       The configuration to transfer"]
    pub configurationChanged: ::std::option::Option<
        unsafe extern "C" fn(
            cbparam: *mut ::std::os::raw::c_void,
            configuration: *const libcec_configuration,
        ),
    >,
    #[doc = " @brief Transfer a libcec alert message from libCEC to the client"]
    #[doc = " @param cbparam             Callback parameter provided when the callbacks were set up"]
    #[doc = " @param alert               The alert type transfer."]
    #[doc = " @param data                Misc. additional information."]
    pub alert: ::std::option::Option<
        unsafe extern "C" fn(
            cbparam: *mut ::std::os::raw::c_void,
            alert: libcec_alert,
            param: libcec_parameter,
        ),
    >,
    #[doc = " @brief Transfer a menu state change to the client."]
    #[doc = " Transfer a menu state change to the client. If the command returns 1, then the change will be processed by"]
    #[doc = " the busdevice. If 0, then the state of the busdevice won't be changed, and will always be kept 'activated',"]
    #[doc = " @warning CEC does not allow the player to suppress the menu state change on the TV, so the menu on the TV will always be displayed, whatever the return value of this method is."]
    #[doc = " so keypresses are always routed."]
    #[doc = " @param cbparam             Callback parameter provided when the callbacks were set up"]
    #[doc = " @param state               The new value."]
    #[doc = ""]
    #[doc = " @return 1 if libCEC should use this new value, 0 otherwise."]
    pub menuStateChanged: ::std::option::Option<
        unsafe extern "C" fn(
            cbparam: *mut ::std::os::raw::c_void,
            state: cec_menu_state,
        ) -> ::std::os::raw::c_int,
    >,
    #[doc = " @brief Called when a source that's handled by this client is activated."]
    #[doc = " @param cbparam             Callback parameter provided when the callbacks were set up"]
    #[doc = " @param logicalAddress      The address that was just activated."]
    #[doc = " @param bActivated          1 if activated, 0 when deactivated."]
    pub sourceActivated: ::std::option::Option<
        unsafe extern "C" fn(
            cbParam: *mut ::std::os::raw::c_void,
            logicalAddress: cec_logical_address,
            bActivated: u8,
        ),
    >,
}
#[test]
fn bindgen_test_layout_ICECCallbacks() {
    assert_eq!(
        ::std::mem::size_of::<ICECCallbacks>(),
        56usize,
        concat!("Size of: ", stringify!(ICECCallbacks))
    );
    assert_eq!(
        ::std::mem::align_of::<ICECCallbacks>(),
        8usize,
        concat!("Alignment of ", stringify!(ICECCallbacks))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ICECCallbacks>())).logMessage as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ICECCallbacks),
            "::",
            stringify!(logMessage)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ICECCallbacks>())).keyPress as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ICECCallbacks),
            "::",
            stringify!(keyPress)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ICECCallbacks>())).commandReceived as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ICECCallbacks),
            "::",
            stringify!(commandReceived)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ICECCallbacks>())).configurationChanged as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(ICECCallbacks),
            "::",
            stringify!(configurationChanged)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ICECCallbacks>())).alert as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(ICECCallbacks),
            "::",
            stringify!(alert)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ICECCallbacks>())).menuStateChanged as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(ICECCallbacks),
            "::",
            stringify!(menuStateChanged)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ICECCallbacks>())).sourceActivated as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(ICECCallbacks),
            "::",
            stringify!(sourceActivated)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct libcec_configuration {
    #[doc = "< the version of the client that is connecting"]
    pub clientVersion: u32,
    #[doc = "< the device name to use on the CEC bus"]
    pub strDeviceName: [::std::os::raw::c_char; 13usize],
    #[doc = "< the device type(s) to use on the CEC bus for libCEC"]
    pub deviceTypes: cec_device_type_list,
    #[doc = "< (read only) set to 1 by libCEC when the physical address was autodetected"]
    pub bAutodetectAddress: u8,
    #[doc = "< the physical address of the CEC adapter"]
    pub iPhysicalAddress: u16,
    #[doc = "< the logical address of the device to which the adapter is connected. only used when iPhysicalAddress = 0 or when the adapter doesn't support autodetection"]
    pub baseDevice: cec_logical_address,
    #[doc = "< the HDMI port to which the adapter is connected. only used when iPhysicalAddress = 0 or when the adapter doesn't support autodetection"]
    pub iHDMIPort: u8,
    #[doc = "< override the vendor ID of the TV. leave this untouched to autodetect"]
    pub tvVendor: u32,
    #[doc = "< list of devices to wake when initialising libCEC or when calling PowerOnDevices() without any parameter."]
    pub wakeDevices: cec_logical_addresses,
    #[doc = "< list of devices to power off when calling StandbyDevices() without any parameter."]
    pub powerOffDevices: cec_logical_addresses,
    #[doc = "< the version number of the server. read-only"]
    pub serverVersion: u32,
    #[doc = "< true to get the settings from the ROM (if set, and a v2 ROM is present), false to use these settings."]
    pub bGetSettingsFromROM: u8,
    #[doc = "< make libCEC the active source on the bus when starting the player application"]
    pub bActivateSource: u8,
    #[doc = "< put this PC in standby mode when the TV is switched off. only used when bShutdownOnStandby = 0"]
    pub bPowerOffOnStandby: u8,
    #[doc = "< the object to pass along with a call of the callback methods. NULL to ignore"]
    pub callbackParam: *mut ::std::os::raw::c_void,
    #[doc = "< the callback methods to use. set this to NULL when not using callbacks"]
    pub callbacks: *mut ICECCallbacks,
    #[doc = "< (read-only) the current logical addresses. added in 1.5.3"]
    pub logicalAddresses: cec_logical_addresses,
    #[doc = "< (read-only) the firmware version of the adapter. added in 1.6.0"]
    pub iFirmwareVersion: u16,
    #[doc = "< the menu language used by the client. 3 character ISO 639-2 country code. see http://http://www.loc.gov/standards/iso639-2/ added in 1.6.2"]
    pub strDeviceLanguage: [::std::os::raw::c_char; 3usize],
    #[doc = "< (read-only) the build date of the firmware, in seconds since epoch. if not available, this value will be set to 0. added in 1.6.2"]
    pub iFirmwareBuildDate: u32,
    #[doc = "< won't allocate a CCECClient when starting the connection when set (same as monitor mode). added in 1.6.3"]
    pub bMonitorOnly: u8,
    #[doc = "< CEC spec version to use by libCEC. defaults to v1.4. added in 1.8.0"]
    pub cecVersion: cec_version,
    #[doc = "< type of the CEC adapter that we're connected to. added in 1.8.2"]
    pub adapterType: cec_adapter_type,
    #[doc = "< key code that initiates combo keys. defaults to CEC_USER_CONTROL_CODE_F1_BLUE. CEC_USER_CONTROL_CODE_UNKNOWN to disable. added in 2.0.5"]
    pub comboKey: cec_user_control_code,
    #[doc = "< timeout until the combo key is sent as normal keypress"]
    pub iComboKeyTimeoutMs: u32,
    #[doc = "< rate at which buttons autorepeat. 0 means rely on CEC device"]
    pub iButtonRepeatRateMs: u32,
    #[doc = "< duration after last update until a button is considered released"]
    pub iButtonReleaseDelayMs: u32,
    #[doc = "< prevent double taps within this timeout. defaults to 200ms. added in 4.0.0"]
    pub iDoubleTapTimeoutMs: u32,
    #[doc = "< set to 1 to automatically waking an AVR when the source is activated. added in 4.0.0"]
    pub bAutoWakeAVR: u8,
}
#[test]
fn bindgen_test_layout_libcec_configuration() {
    assert_eq!(
        ::std::mem::size_of::<libcec_configuration>(),
        336usize,
        concat!("Size of: ", stringify!(libcec_configuration))
    );
    assert_eq!(
        ::std::mem::align_of::<libcec_configuration>(),
        8usize,
        concat!("Alignment of ", stringify!(libcec_configuration))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<libcec_configuration>())).clientVersion as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(libcec_configuration),
            "::",
            stringify!(clientVersion)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<libcec_configuration>())).strDeviceName as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(libcec_configuration),
            "::",
            stringify!(strDeviceName)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<libcec_configuration>())).deviceTypes as *const _ as usize
        },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(libcec_configuration),
            "::",
            stringify!(deviceTypes)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<libcec_configuration>())).bAutodetectAddress as *const _ as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(libcec_configuration),
            "::",
            stringify!(bAutodetectAddress)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<libcec_configuration>())).iPhysicalAddress as *const _ as usize
        },
        42usize,
        concat!(
            "Offset of field: ",
            stringify!(libcec_configuration),
            "::",
            stringify!(iPhysicalAddress)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<libcec_configuration>())).baseDevice as *const _ as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(libcec_configuration),
            "::",
            stringify!(baseDevice)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<libcec_configuration>())).iHDMIPort as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(libcec_configuration),
            "::",
            stringify!(iHDMIPort)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<libcec_configuration>())).tvVendor as *const _ as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(libcec_configuration),
            "::",
            stringify!(tvVendor)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<libcec_configuration>())).wakeDevices as *const _ as usize
        },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(libcec_configuration),
            "::",
            stringify!(wakeDevices)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<libcec_configuration>())).powerOffDevices as *const _ as usize
        },
        124usize,
        concat!(
            "Offset of field: ",
            stringify!(libcec_configuration),
            "::",
            stringify!(powerOffDevices)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<libcec_configuration>())).serverVersion as *const _ as usize
        },
        192usize,
        concat!(
            "Offset of field: ",
            stringify!(libcec_configuration),
            "::",
            stringify!(serverVersion)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<libcec_configuration>())).bGetSettingsFromROM as *const _
                as usize
        },
        196usize,
        concat!(
            "Offset of field: ",
            stringify!(libcec_configuration),
            "::",
            stringify!(bGetSettingsFromROM)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<libcec_configuration>())).bActivateSource as *const _ as usize
        },
        197usize,
        concat!(
            "Offset of field: ",
            stringify!(libcec_configuration),
            "::",
            stringify!(bActivateSource)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<libcec_configuration>())).bPowerOffOnStandby as *const _ as usize
        },
        198usize,
        concat!(
            "Offset of field: ",
            stringify!(libcec_configuration),
            "::",
            stringify!(bPowerOffOnStandby)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<libcec_configuration>())).callbackParam as *const _ as usize
        },
        200usize,
        concat!(
            "Offset of field: ",
            stringify!(libcec_configuration),
            "::",
            stringify!(callbackParam)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<libcec_configuration>())).callbacks as *const _ as usize },
        208usize,
        concat!(
            "Offset of field: ",
            stringify!(libcec_configuration),
            "::",
            stringify!(callbacks)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<libcec_configuration>())).logicalAddresses as *const _ as usize
        },
        216usize,
        concat!(
            "Offset of field: ",
            stringify!(libcec_configuration),
            "::",
            stringify!(logicalAddresses)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<libcec_configuration>())).iFirmwareVersion as *const _ as usize
        },
        284usize,
        concat!(
            "Offset of field: ",
            stringify!(libcec_configuration),
            "::",
            stringify!(iFirmwareVersion)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<libcec_configuration>())).strDeviceLanguage as *const _ as usize
        },
        286usize,
        concat!(
            "Offset of field: ",
            stringify!(libcec_configuration),
            "::",
            stringify!(strDeviceLanguage)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<libcec_configuration>())).iFirmwareBuildDate as *const _ as usize
        },
        292usize,
        concat!(
            "Offset of field: ",
            stringify!(libcec_configuration),
            "::",
            stringify!(iFirmwareBuildDate)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<libcec_configuration>())).bMonitorOnly as *const _ as usize
        },
        296usize,
        concat!(
            "Offset of field: ",
            stringify!(libcec_configuration),
            "::",
            stringify!(bMonitorOnly)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<libcec_configuration>())).cecVersion as *const _ as usize },
        300usize,
        concat!(
            "Offset of field: ",
            stringify!(libcec_configuration),
            "::",
            stringify!(cecVersion)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<libcec_configuration>())).adapterType as *const _ as usize
        },
        304usize,
        concat!(
            "Offset of field: ",
            stringify!(libcec_configuration),
            "::",
            stringify!(adapterType)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<libcec_configuration>())).comboKey as *const _ as usize },
        308usize,
        concat!(
            "Offset of field: ",
            stringify!(libcec_configuration),
            "::",
            stringify!(comboKey)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<libcec_configuration>())).iComboKeyTimeoutMs as *const _ as usize
        },
        312usize,
        concat!(
            "Offset of field: ",
            stringify!(libcec_configuration),
            "::",
            stringify!(iComboKeyTimeoutMs)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<libcec_configuration>())).iButtonRepeatRateMs as *const _
                as usize
        },
        316usize,
        concat!(
            "Offset of field: ",
            stringify!(libcec_configuration),
            "::",
            stringify!(iButtonRepeatRateMs)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<libcec_configuration>())).iButtonReleaseDelayMs as *const _
                as usize
        },
        320usize,
        concat!(
            "Offset of field: ",
            stringify!(libcec_configuration),
            "::",
            stringify!(iButtonReleaseDelayMs)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<libcec_configuration>())).iDoubleTapTimeoutMs as *const _
                as usize
        },
        324usize,
        concat!(
            "Offset of field: ",
            stringify!(libcec_configuration),
            "::",
            stringify!(iDoubleTapTimeoutMs)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<libcec_configuration>())).bAutoWakeAVR as *const _ as usize
        },
        328usize,
        concat!(
            "Offset of field: ",
            stringify!(libcec_configuration),
            "::",
            stringify!(bAutoWakeAVR)
        )
    );
}
pub type libcec_connection_t = *mut ::std::os::raw::c_void;
extern "C" {
    pub fn libcec_initialise(configuration: *mut libcec_configuration) -> libcec_connection_t;
}
extern "C" {
    pub fn libcec_destroy(connection: libcec_connection_t);
}
extern "C" {
    pub fn libcec_open(
        connection: libcec_connection_t,
        strPort: *const ::std::os::raw::c_char,
        iTimeout: u32,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn libcec_close(connection: libcec_connection_t);
}
extern "C" {
    pub fn libcec_clear_configuration(configuration: *mut libcec_configuration);
}
extern "C" {
    pub fn libcec_enable_callbacks(
        connection: libcec_connection_t,
        cbParam: *mut ::std::os::raw::c_void,
        callbacks: *mut ICECCallbacks,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn libcec_find_adapters(
